Tekla Open API Reference for Tekla Structures 2025
ProjectInfo.GetCurrentCoordsysBasePoint Method
 Gets the current base point, if set.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static BasePoint GetCurrentCoordsysBasePoint()
Public Shared Function GetCurrentCoordsysBasePoint As BasePoint
Return Value
Type: BasePoint
The current base point, if set. Otherwise null.
See Also
Reference
ProjectInfo Class
Tekla.Structures.Model Namespace